<a href="https://colab.research.google.com/github/nadireus/Data-Analysisi-with-SQL/blob/main/Data_Analysis_with_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [80]:
import pandas as pd
import sqlite3

In [81]:
data= sqlite3.connect('example.db')

In [38]:
sql= ''' CREATE TABLE Actions (
      Visitor_ID int,
      Adv_Type varchar(255),
   	  Action  varchar(255)
    
);




INSERT INTO Actions( Visitor_ID, Adv_Type, Action)
VALUES
       ('1','A','Left'),
       ('2','A','order'),
       ('3','B','Left'),
       ('4','A','order'),
       ('5','A','Review'),
       ('6','A','Left'),
	     ('7','B','Left'),
	     ('8','B','order'),
       ('9','B','Review'),
       ('10','A','Review');

'''

In [39]:
cur=data.cursor()

In [40]:
cur.executescript(sql)

In [41]:
sql = ''' select * from Actions '''

In [42]:
pd.read_sql(sql, data)

   Visitor_ID Adv_Type  Action
0           1        A    Left
1           2        A   order
2           3        B    Left
3           4        A   order
4           5        A  Review
5           6        A    Left
6           7        B    Left
7           8        B   order
8           9        B  Review
9          10        A  Review

In [ ]:
CREATE VIEW Total_info
AS SELECT 
    Adv_Type,
	COUNT(CASE WHEN Action = 'Order' then 1 ELSE NULL END) as "total_order",
    COUNT(Action) as "total_action"
	FROM  Actions											
	GROUP BY Adv_Type;

In [83]:
sql = ''' select*from Total_info '''

In [82]:
sql = ''' SELECT Adv_Type, ROUND((CAST(total_order AS Float)/total_action), 2) as conversion_rate
FROM TOtal_info; '''

####          or with one code indicated below we can get the same result

In [69]:
sql = ''' 

  SELECT Adv_Type, total_order /total_action as conversion_rate
        FROM (SELECT Adv_Type,COUNT(CASE WHEN Action = 'Order' then 1 ELSE NULL END) as "total_order", COUNT(Action) as "total_action"
	          FROM  Actions											
	          GROUP BY Adv_Type) as Total_info;
'''